Pandas is an open source library providing high performance, easy-to data strucrures and data analysis tools for the Python programming language.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index = ['R1', 'R2', 'R3', 'R4', 'R5'], columns = ['C1', 'C2', 'C3', 'C4'])

In [4]:
df.head()

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [5]:
df.loc['R1'] # Access elements 1

C1    0
C2    1
C3    2
C4    3
Name: R1, dtype: int32

In [9]:
type(df.loc['R1'])

pandas.core.series.Series

### Access elements

In [11]:
df.iloc[:2,:2] # Access elements 1 : specify row index and col index

    C1  C2
R1   0   1
R2   4   5

### Convert dataframe into an array

In [12]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [13]:
df.iloc[:,1:].values.shape

(5, 3)

### To check how many null values are in data frame

In [14]:
df.isnull().sum()

# 0 null values in all columns

C1    0
C2    0
C3    0
C4    0
dtype: int64

### To display multiple list, display it in a list

In [15]:
df[['C1','C2']]

    C1  C2
R1   0   1
R2   4   5
R3   8   9
R4  12  13
R5  16  17

In [20]:
df['C1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: C1, dtype: int64

In [21]:
#How many unique values are there in column
df['C1'].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)

In [7]:
df=pd.read_csv('AirPassengers.csv')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 2 columns):
Month          144 non-null object
#Passengers    144 non-null int64
dtypes: int64(1), object(1)
memory usage: 2.4+ KB

In [9]:
df.describe()

       #Passengers
count   144.000000
mean    280.298611
std     119.966317
min     104.000000
25%     180.000000
50%     265.500000
75%     360.500000
max     622.000000

In [60]:
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [61]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [62]:
type(data)

str

In [63]:
from io import StringIO, BytesIO
df = pd.read_csv(StringIO(data))

In [64]:
df

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

### Read Specific Cols

In [69]:
#df = pd.read_csv(StringIO(data), usecols = lambda x:x.upper() in ['b','c'])

df = pd.read_csv(StringIO(data), usecols=['a','b'])
df

   a   b
0  1   2
1  5   6
2  9  10

In [70]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [71]:
df = pd.read_csv(StringIO(data), dtype = {'b':int,'c':np.float,'a':'Int32'})

In [72]:
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

### Index Columns

In [88]:
data1 = ('index,a,b,c\n'
          '4,apple,bat,5.7\n'
          '8,orange,cow,10')

In [89]:
data1

'index,a,b,c\n4,apple,bat,5.7\n8,orange,cow,10'

In [82]:
pd.read_csv(StringIO(data1))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [84]:
#Make first col as index
pd.read_csv(StringIO(data1),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [85]:
pd.read_csv(StringIO(data1),index_col=1)

        index    b     c
a
apple       4  bat   5.7
orange      8  cow  10.0

In [67]:
df=pd.read_csv('AirPassengers.csv')
df[df['#Passengers']>400]

       Month  #Passengers
90   1956-07          413
91   1956-08          405
101  1957-06          422
102  1957-07          465
103  1957-08          467
104  1957-09          404
113  1958-06          435
114  1958-07          491
115  1958-08          505
116  1958-09          404
122  1959-03          406
124  1959-05          420
125  1959-06          472
126  1959-07          548
127  1959-08          559
128  1959-09          463
129  1959-10          407
131  1959-12          405
132  1960-01          417
134  1960-03          419
135  1960-04          461
136  1960-05          472
137  1960-06          535
138  1960-07          622
139  1960-08          606
140  1960-09          508
141  1960-10          461
143  1960-12          432

In [35]:
df.corr()

             #Passengers
#Passengers          1.0

In [10]:
df.to_json(orient = 'index')

'{"0":{"Month":"1949-01","#Passengers":112},"1":{"Month":"1949-02","#Passengers":118},"2":{"Month":"1949-03","#Passengers":132},"3":{"Month":"1949-04","#Passengers":129},"4":{"Month":"1949-05","#Passengers":121},"5":{"Month":"1949-06","#Passengers":135},"6":{"Month":"1949-07","#Passengers":148},"7":{"Month":"1949-08","#Passengers":148},"8":{"Month":"1949-09","#Passengers":136},"9":{"Month":"1949-10","#Passengers":119},"10":{"Month":"1949-11","#Passengers":104},"11":{"Month":"1949-12","#Passengers":118},"12":{"Month":"1950-01","#Passengers":115},"13":{"Month":"1950-02","#Passengers":126},"14":{"Month":"1950-03","#Passengers":141},"15":{"Month":"1950-04","#Passengers":135},"16":{"Month":"1950-05","#Passengers":125},"17":{"Month":"1950-06","#Passengers":149},"18":{"Month":"1950-07","#Passengers":170},"19":{"Month":"1950-08","#Passengers":170},"20":{"Month":"1950-09","#Passengers":158},"21":{"Month":"1950-10","#Passengers":133},"22":{"Month":"1950-11","#Passengers":114},"23":{"Month":"1950-12","#Passengers":140},"24":{"Month":"1951-01","#Passengers":145},"25":{"Month":"1951-02","#Passengers":150},"26":{"Month":"1951-03","#Passengers":178},"27":{"Month":"1951-04","#Passengers":163},"28":{"Month":"1951-05","#Passengers":172},"29":{"Month":"1951-06","#Passengers":178},"30":{"Month":"1951-07","#Passengers":199},"31":{"Month":"1951-08","#Passengers":199},"32":{"Month":"1951-09","#Passengers":184},"33":{"Month":"1951-10","#Passengers":162},"34":{"Month":"1951-11","#Passengers":146},"35":{"Month":"1951-12","#Passengers":166},"36":{"Month":"1952-01","#Passengers":171},"37":{"Month":"1952-02","#Passengers":180},"38":{"Month":"1952-03","#Passengers":193},"39":{"Month":"1952-04","#Passengers":181},"40":{"Month":"1952-05","#Passengers":183},"41":{"Month":"1952-06","#Passengers":218},"42":{"Month":"1952-07","#Passengers":230},"43":{"Month":"1952-08","#Passengers":242},"44":{"Month":"1952-09","#Passengers":209},"45":{"Month":"1952-10","#Passengers":191},"46":{"Month":"1952-11","#Passengers":172},"47":{"Month":"1952-12","#Passengers":194},"48":{"Month":"1953-01","#Passengers":196},"49":{"Month":"1953-02","#Passengers":196},"50":{"Month":"1953-03","#Passengers":236},"51":{"Month":"1953-04","#Passengers":235},"52":{"Month":"1953-05","#Passengers":229},"53":{"Month":"1953-06","#Passengers":243},"54":{"Month":"1953-07","#Passengers":264},"55":{"Month":"1953-08","#Passengers":272},"56":{"Month":"1953-09","#Passengers":237},"57":{"Month":"1953-10","#Passengers":211},"58":{"Month":"1953-11","#Passengers":180},"59":{"Month":"1953-12","#Passengers":201},"60":{"Month":"1954-01","#Passengers":204},"61":{"Month":"1954-02","#Passengers":188},"62":{"Month":"1954-03","#Passengers":235},"63":{"Month":"1954-04","#Passengers":227},"64":{"Month":"1954-05","#Passengers":234},"65":{"Month":"1954-06","#Passengers":264},"66":{"Month":"1954-07","#Passengers":302},"67":{"Month":"1954-08","#Passengers":293},"68":{"Month":"1954-09","#Passengers":259},"69":{"Month":"1954-10","#Passengers":229},"70":{"Month":"1954-11","#Passengers":203},"71":{"Month":"1954-12","#Passengers":229},"72":{"Month":"1955-01","#Passengers":242},"73":{"Month":"1955-02","#Passengers":233},"74":{"Month":"1955-03","#Passengers":267},"75":{"Month":"1955-04","#Passengers":269},"76":{"Month":"1955-05","#Passengers":270},"77":{"Month":"1955-06","#Passengers":315},"78":{"Month":"1955-07","#Passengers":364},"79":{"Month":"1955-08","#Passengers":347},"80":{"Month":"1955-09","#Passengers":312},"81":{"Month":"1955-10","#Passengers":274},"82":{"Month":"1955-11","#Passengers":237},"83":{"Month":"1955-12","#Passengers":278},"84":{"Month":"1956-01","#Passengers":284},"85":{"Month":"1956-02","#Passengers":277},"86":{"Month":"1956-03","#Passengers":317},"87":{"Month":"1956-04","#Passengers":313},"88":{"Month":"1956-05","#Passengers":318},"89":{"Month":"1956-06","#Passengers":374},"90":{"Month":"1956-07","#Passengers":413},"91":{"Month":"1956-08","#Passengers":405},"92":{"Month":"1956-09","#Passengers":355},"93":{"Month":"1956-10","#Passengers":306},"94":{"Month":"1956-11","#Passengers":271},"95":{"Month":"1956-12","#Passengers":306},"96":{"Month":"1957-01","#Passengers":315},"97":{"Month":"1957-02","#Passengers":301},"98":{"Month":"1957-03","#Passengers":356},"99":{"Month":"1957-04","#Passengers":348},"100":{"Month":"1957-05","#Passengers":355},"101":{"Month":"1957-06","#Passengers":422},"102":{"Month":"1957-07","#Passengers":465},"103":{"Month":"1957-08","#Passengers":467},"104":{"Month":"1957-09","#Passengers":404},"105":{"Month":"1957-10","#Passengers":347},"106":{"Month":"1957-11","#Passengers":305},"107":{"Month":"1957-12","#Passengers":336},"108":{"Month":"1958-01","#Passengers":340},"109":{"Month":"1958-02","#Passengers":318},"110":{"Month":"1958-03","#Passengers":362},"111":{"Month":"1958-04","#Passengers":348},"112":{"Month":"1958-05","#Passengers":363},"113":{"Month":"1958-06","#Passengers":435},"114":{"Month":"1958-07","#Passengers":491},"115":{"Month":"1958-08","#Passengers":505},"116":{"Month":"1958-09","#Passengers":404},"117":{"Month":"1958-10","#Passengers":359},"118":{"Month":"1958-11","#Passengers":310},"119":{"Month":"1958-12","#Passengers":337},"120":{"Month":"1959-01","#Passengers":360},"121":{"Month":"1959-02","#Passengers":342},"122":{"Month":"1959-03","#Passengers":406},"123":{"Month":"1959-04","#Passengers":396},"124":{"Month":"1959-05","#Passengers":420},"125":{"Month":"1959-06","#Passengers":472},"126":{"Month":"1959-07","#Passengers":548},"127":{"Month":"1959-08","#Passengers":559},"128":{"Month":"1959-09","#Passengers":463},"129":{"Month":"1959-10","#Passengers":407},"130":{"Month":"1959-11","#Passengers":362},"131":{"Month":"1959-12","#Passengers":405},"132":{"Month":"1960-01","#Passengers":417},"133":{"Month":"1960-02","#Passengers":391},"134":{"Month":"1960-03","#Passengers":419},"135":{"Month":"1960-04","#Passengers":461},"136":{"Month":"1960-05","#Passengers":472},"137":{"Month":"1960-06","#Passengers":535},"138":{"Month":"1960-07","#Passengers":622},"139":{"Month":"1960-08","#Passengers":606},"140":{"Month":"1960-09","#Passengers":508},"141":{"Month":"1960-10","#Passengers":461},"142":{"Month":"1960-11","#Passengers":390},"143":{"Month":"1960-12","#Passengers":432}}'

### Reading HTML

In [11]:
url= 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
dfs = pd.read_html(url)

#pandas extract the table info from the pg

In [17]:
dfs[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [23]:
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(url_mcc, match = 'Country', header=0)

#try to match word country in Table col and extract that table

In [20]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

### Pickling

All pandas objects are equipped with to_pickle methods which use Python's cPickle module to save data structures to disk using the pickle format.

In [28]:
df.to_pickle('df')

In [29]:
df_p = pd.read_pickle('df')

In [30]:
df_p.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121